Словарь/src/InformationRegisters/ПарыНеДублей/ПарыНеДублей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПарыНеДублей</name>
  <dimensions>
    <name>Элемент1</name>
    <type>
      <types>CatalogRef.Словарь</types>
      <types>CatalogRef.Канджи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Элемент2</name>
    <type>
      <types>CatalogRef.Словарь</types>
      <types>CatalogRef.Канджи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Словарь/src/InformationRegisters/СвязанныеСлова/СвязанныеСлова.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязанныеСлова</name>
  <dimensions>
    <name>Слово1</name>
    <type>
      <types>CatalogRef.Словарь</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Слово2</name>
    <type>
      <types>CatalogRef.Словарь</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Словарь/src/CommonForms/ФормаИнформацииОДублях/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПроверяемыйОбъект = Параметры.ПроверяемыйОбъект;
	
	АдресВХ = Параметры.ИнформацияОДублях;
	ТаблицаДублей = ПолучитьИзВременногоХранилища(АдресВХ);
	СоздатьРеквизитЭлементыТаблицы(ТаблицаДублей);
	
	ПроверитьРазрешенаПометкаНеДубля(ТаблицаДублей);
	УстановитьДоступностьЭлементовФормы();
	ЗаполнитьТаблицуДублей(ТаблицаДублей);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЭтоНеДубли(Команда)
	
	ОтмеченныеСтроки = Элементы[ИмяТаблицыДублей].ВыделенныеСтроки;
	Если ОтмеченныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	СвязанныеСсылки = Новый Массив;
	Для Каждого СтрокаТаблицы Из ОтмеченныеСтроки Цикл
		
		СтрокаТаблицы = ЭтотОбъект[ИмяТаблицыДублей].НайтиПоИдентификатору(СтрокаТаблицы);
		СвязанныеСсылки.Добавить(СтрокаТаблицы.Ссылка);
		
	КонецЦикла;
	
	ЗаписатьНеДубли(СвязанныеСсылки);
	Оповестить("Запись_ЭтоНеДубли", ПроверяемыйОбъект);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуДублей(ТаблицаЗначений)
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		//@skip-check bsl-legacy-check-string-literal
		НоваяСтрока = ЭтотОбъект["ТаблицаДублей"].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

// Записать связанные слова.
// 
// Параметры:
//  СвязанныеСсылки - Массив из СправочникСсылка - Связанные слова
&НаСервере
Процедура ЗаписатьНеДубли(СвязанныеСсылки)
	
	УдалитьНеДубли();
	
	НаборЗаписей = РегистрыСведений.ПарыНеДублей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Элемент1.Установить(ПроверяемыйОбъект);
	
	Для Каждого СвязаннаяСсылка Из СвязанныеСсылки Цикл
		Если НЕ ЗначениеЗаполнено(СвязаннаяСсылка) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ОбщегоНазначения.СсылкаСуществует(СвязаннаяСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = НаборЗаписей.Добавить();
		Запись.Элемент1 = ПроверяемыйОбъект;
		Запись.Элемент2 = СвязаннаяСсылка;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры
	
&НаСервере
Процедура УдалитьНеДубли()

	Набор1 = РегистрыСведений.ПарыНеДублей.СоздатьНаборЗаписей();
	Набор1.Отбор.Элемент1.Установить(ПроверяемыйОбъект);
	Набор1.Записать();
	
	Набор2 = РегистрыСведений.СвязанныеСлова.СоздатьНаборЗаписей();
	Набор2.Отбор.Слово2.Установить(ПроверяемыйОбъект);
	Набор2.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРазрешенаПометкаНеДубля(ТаблицаДублей)

	Если НЕ ЗначениеЗаполнено(ПроверяемыйОбъект) Тогда
		РазрешенаПометкаНеДубля = Ложь;
		Возврат;
	КонецЕсли;
	
	// Если нет колонки "Ссылка", то жее
	Если ТаблицаДублей.Колонки.Найти("Ссылка") = Неопределено Тогда
		РазрешенаПометкаНеДубля = Ложь;
		Возврат;
	КонецЕсли;
	
	РазрешенаПометкаНеДубля = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитЭлементыТаблицы(ТаблицаЗначений)
	
	ИмяТаблицыДублей = "ТаблицаДублей";
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицыДублей, Новый ОписаниеТипов("ТаблицаЗначений")));
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		МассивДобавляемыхРеквизитов.Добавить(
    		Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяТаблицыДублей, Колонка.Имя));
	КонецЦикла;
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	ТаблицаФормы = Элементы.Добавить(ИмяТаблицыДублей, Тип("ТаблицаФормы"), ЭтотОбъект);
	ТаблицаФормы.ПутьКДанным = ИмяТаблицыДублей;
	Элементы.Переместить(Элементы.ФормаЭтоНеДубли, ТаблицаФормы.КоманднаяПанель);
	
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		НоваяКолонка = Элементы.Добавить(ИмяТаблицыДублей + Колонка.Имя, Тип("ПолеФормы"), Элементы[ИмяТаблицыДублей]);
		НоваяКолонка.Заголовок = ПростыеТипыКлиентСервер.ИмяКолонкиВЗаголовок(Колонка.Имя);
		НоваяКолонка.ПутьКДанным = ИмяТаблицыДублей + "." + Колонка.Имя;
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ТолькоПросмотр = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.ФормаЭтоНеДубли.Видимость = РазрешенаПометкаНеДубля;
	
КонецПроцедуры

#КонецОбласти
